# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'
brew 'httpie'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Zsh Plugins
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Zsh Themes
brew 'spaceship'

# Apps
cask '1password'
cask '1password-cli'
cask 'arc'
cask 'cyberduck'
cask 'dbngin'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'herd'
cask 'hyperkey'
cask 'imageoptim'
cask 'httpie'
cask 'iterm2'
cask 'monitorcontrol'
cask 'nordvpn'
cask 'notion-calendar'
cask 'obsidian'
cask 'quitter'
cask 'raycast'
cask 'readdle-spark'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
cask 'warp'
cask 'setapp'
cask 'superlist'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
