# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Zsh Plugins
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Zsh Themes
brew 'spaceship'


# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'raycast'
cask 'cleanmymac'
cask 'dbngin'
cask 'discord'
cask 'expressvpn'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'notion'
cask 'obsidian'
cask 'slack'
cask 'rectangle'
cask 'spotify'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
cask 'microsoft-teams'
cask 'monitorcontrol'
cask 'cyberduck'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Pages', id: 409201541
mas 'TickTick: Things & Tasks To Do', id: 966085870
